# read design 
read_verilog VSPCore.v

# elaborate design hierarchy
hierarchy -check -top VSPCore

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

#To make easy to parse for V2TT
flatten;

# mapping logic to gates.
abc -g gates,MUX

dfflegalize -cell $_DFF_P_ 01

# cleanup
opt_expr; opt_clean
clean -purge

# write synthesized design
write_json vsp-core-pearl.json
